# 데이터 합치기

## merge
- 두개의 데이터프레임을 하나로 합치는 함수
- 기준 컬럼이 맞으면 연결

#### merge 의 종류
- inner join: 양쪽 데이터에서 공통된 부분만 가지고 온다  
- left join: 왼쪽 데이터는 모두 가져오고, 오른쪽은 겹치는 부분만  
- right join: 오른쪽 데이터는 모두 가져오고, 인쪽은 겹치는 부분만  
- outer join: 양쪽데이터를 모두 가져옴

In [7]:
# 학생정보와 시험점수 합치기
# pd.merge(데이터1, 데이터2, 공통컬럼)
# inner join(기본값)
pd.merge(df1,df2, on='학번')

   학번  이름  점수
0   1  철수  90
1   2  영희  85

In [1]:
import numpy as np
import pandas as pd

In [6]:
df1 = pd.DataFrame({'학번':[1,2,3],'이름':['철수','영희','민수']})
df1

   학번  이름
0   1  철수
1   2  영희
2   3  민수

In [3]:
df2 = pd.DataFrame({'학번':[1,2,4], '점수':[90,85,70]})
df2

   학번  점수
0   1  90
1   2  85
2   4  70

In [8]:
# left join
pd.merge(df1,df2, on='학번', how='left')

   학번  이름    점수
0   1  철수  90.0
1   2  영희  85.0
2   3  민수   NaN

In [9]:
# right join
pd.merge(df1,df2, on='학번', how='right')

   학번   이름  점수
0   1   철수  90
1   2   영희  85
2   4  NaN  70

In [17]:
df1 = pd.DataFrame({'고객ID':[101,102,103],'이름':['철수','영희','민수']})
df2 = pd.DataFrame({'고객ID':[101,104,102], '상품':['노트북','청소기','책']})

pd.merge(df1,df2, on='고객ID')

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [16]:
df1 = pd.DataFrame({'사번':[1,2,3],'이름':['홍길동','임꺽정','이몽룡']})
df2 = pd.DataFrame({'사번':[1,3],'부서':['영업','개발']})

pd.merge(df1,df2, on ='사번', how='left')

   사번   이름   부서
0   1  홍길동   영업
1   2  임꺽정  NaN
2   3  이몽룡   개발

In [18]:
df1 = pd.DataFrame({'상품코드':['A1','A2','A3'],'상품명':['노트북','청소기','책상']})
df2 = pd.DataFrame({'상품코드':['A2','A3','A4'], '재고':[5,8,10]})
pd.merge(df1,df2, on='상품코드', how='right')

  상품코드  상품명  재고
0   A2  청소기   5
1   A3   책상   8
2   A4  NaN  10

In [19]:
df1 = pd.DataFrame({'학번':['1','2','3'],'이름':['지훈','서연','민지']})
df2 = pd.DataFrame({'학번':['2','4'], '동아리':['축구부','합창단']})
pd.merge(df1,df2, on='학번', how='outer')

  학번   이름  동아리
0  1   지훈  NaN
1  2   서연  축구부
2  3   민지  NaN
3  4  NaN  합창단

In [21]:
df_join = (df1.set_index('학번')
             .join(df2.set_index('학번'), how='outer')
             .reset_index())
df_join

  학번   이름  동아리
0  1   지훈  NaN
1  2   서연  축구부
2  3   민지  NaN
3  4  NaN  합창단